7767517
696 699
pnnx.Input               pnnx_input_0             0 1 img0.1 #img0.1=(1,3,256,256)f32
pnnx.Input               pnnx_input_1             0 1 img1.1 #img1.1=(1,3,256,256)f32
pnnx.Input               pnnx_input_2             0 1 timestep.1 #timestep.1=(1)f32
prim::Constant           pnnx_1                   0 1 31 value=1
prim::Constant           pnnx_2                   0 1 29 value=0
prim::Constant           pnnx_4                   0 1 17 value=1
prim::Constant           pnnx_5                   0 1 19 value=0
prim::Constant           pnnx_6                   0 1 20 value=2147483647
prim::Constant           pnnx_8                   0 1 46 value=3
prim::Constant           pnnx_9                   0 1 98 value=4
prim::Constant           pnnx_10                  0 1 107 value=2
prim::ListConstruct      pnnx_11                  2 1 img0.1 img1.1 16 #img0.1=(1,3,256,256)f32 #img1.1=(1,3,256,256)f32
prim::Constant           pnnx_13                  0 1 792 value=0
prim::Constant           pnnx_14                  0 1 793 value=1
prim::Constant           pnnx_16                  0 1 794 value=1
prim::Constant           pnnx_17                  0 1 795 value=0
prim::Constant           pnnx_18                  0 1 796 value=1
prim::Constant           pnnx_19                  0 1 797 value=1
torch.cat                torch.cat_79             2 1 16 17 18 $tensors=16 $dim=17 #18=(1,6,256,256)f32
Tensor.slice             Tensor.slice_12          5 1 18 19 792 20 793 22 $input=18 $dim=19 $start=792 $end=20 $step=793 #18=(1,6,256,256)f32 #22=(1,6,256,256)f32
Tensor.slice             Tensor.slice_13          5 1 22 794 795 796 797 25 $input=22 $dim=794 $start=795 $end=796 $step=797 #22=(1,6,256,256)f32 #25=(1,1,256,256)f32
torch.clone              torch.clone_87           1 1 25 27 memory_format=torch.contiguous_format $input=25 #25=(1,1,256,256)f32 #27=(1,1,256,256)f32
aten::mul                pnnx_22                  2 1 27 29 30 #27=(1,1,256,256)f32 #30=(1,1,256,256)f32
prim::Constant           pnnx_23                  0 1 798 value=1
aten::add                pnnx_24                  3 1 30 31 798 33 #30=(1,1,256,256)f32 #33=(1,1,256,256)f32
aten::mul                pnnx_25                  2 1 33 timestep.1 36 #33=(1,1,256,256)f32 #timestep.1=(1)f32 #36=(1,1,256,256)f32
prim::Constant           pnnx_29                  0 1 801 value=0
prim::Constant           pnnx_30                  0 1 802 value=0
prim::Constant           pnnx_31                  0 1 803 value=2147483647
prim::Constant           pnnx_32                  0 1 804 value=1
prim::Constant           pnnx_34                  0 1 805 value=1
prim::Constant           pnnx_35                  0 1 806 value=0
prim::Constant           pnnx_36                  0 1 807 value=1
Tensor.slice             Tensor.slice_14          5 1 img0.1 801 802 803 804 44 $input=img0.1 $dim=801 $start=802 $end=803 $step=804 #img0.1=(1,3,256,256)f32 #44=(1,3,256,256)f32
Tensor.slice             Tensor.slice_15          5 1 44 805 806 46 807 input.3 $input=44 $dim=805 $start=806 $end=46 $step=807 #44=(1,3,256,256)f32 #input.3=(1,3,256,256)f32
nn.Conv2d                encode.cnn0              1 1 input.3 317 bias=True dilation=(1,1) groups=1 in_channels=3 kernel_size=(3,3) out_channels=32 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(32)f32 @weight=(32,3,3,3)f32 #input.3=(1,3,256,256)f32 #317=(1,32,128,128)f32
nn.LeakyReLU             encode.relu              1 1 317 318 negative_slope=2.000000e-01 #317=(1,32,128,128)f32 #318=(1,32,128,128)f32
nn.Conv2d                encode.cnn1              1 1 318 319 bias=True dilation=(1,1) groups=1 in_channels=32 kernel_size=(3,3) out_channels=32 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(32)f32 @weight=(32,32,3,3)f32 #318=(1,32,128,128)f32 #319=(1,32,128,128)f32
nn.LeakyReLU             encode.relu              1 1 319 320 negative_slope=2.000000e-01 #319=(1,32,128,128)f32 #320=(1,32,128,128)f32
nn.Conv2d                encode.cnn2              1 1 320 321 bias=True dilation=(1,1) groups=1 in_channels=32 kernel_size=(3,3) out_channels=32 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(32)f32 @weight=(32,32,3,3)f32 #320=(1,32,128,128)f32 #321=(1,32,128,128)f32
nn.LeakyReLU             encode.relu              1 1 321 322 negative_slope=2.000000e-01 #321=(1,32,128,128)f32 #322=(1,32,128,128)f32
nn.ConvTranspose2d       encode.cnn3              1 1 322 323 bias=True dilation=(1,1) groups=1 in_channels=32 kernel_size=(4,4) out_channels=8 output_padding=(0,0) padding=(1,1) stride=(2,2) @bias=(8)f32 @weight=(32,8,4,4)f32 #322=(1,32,128,128)f32 #323=(1,8,256,256)f32
prim::Constant           pnnx_38                  0 1 808 value=0
prim::Constant           pnnx_39                  0 1 809 value=0
prim::Constant           pnnx_40                  0 1 810 value=2147483647
prim::Constant           pnnx_41                  0 1 811 value=1
prim::Constant           pnnx_43                  0 1 812 value=1
prim::Constant           pnnx_44                  0 1 813 value=0
prim::Constant           pnnx_45                  0 1 814 value=3
prim::Constant           pnnx_46                  0 1 815 value=1
Tensor.slice             Tensor.slice_16          5 1 img1.1 808 809 810 811 54 $input=img1.1 $dim=808 $start=809 $end=810 $step=811 #img1.1=(1,3,256,256)f32 #54=(1,3,256,256)f32
Tensor.slice             Tensor.slice_17          5 1 54 812 813 814 815 input0.3 $input=54 $dim=812 $start=813 $end=814 $step=815 #54=(1,3,256,256)f32 #input0.3=(1,3,256,256)f32
nn.Conv2d                encode.cnn0              1 1 input0.3 329 bias=True dilation=(1,1) groups=1 in_channels=3 kernel_size=(3,3) out_channels=32 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(32)f32 @weight=(32,3,3,3)f32 #input0.3=(1,3,256,256)f32 #329=(1,32,128,128)f32
nn.LeakyReLU             encode.relu              1 1 329 330 negative_slope=2.000000e-01 #329=(1,32,128,128)f32 #330=(1,32,128,128)f32
nn.Conv2d                encode.cnn1              1 1 330 331 bias=True dilation=(1,1) groups=1 in_channels=32 kernel_size=(3,3) out_channels=32 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(32)f32 @weight=(32,32,3,3)f32 #330=(1,32,128,128)f32 #331=(1,32,128,128)f32
nn.LeakyReLU             encode.relu              1 1 331 332 negative_slope=2.000000e-01 #331=(1,32,128,128)f32 #332=(1,32,128,128)f32
nn.Conv2d                encode.cnn2              1 1 332 333 bias=True dilation=(1,1) groups=1 in_channels=32 kernel_size=(3,3) out_channels=32 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(32)f32 @weight=(32,32,3,3)f32 #332=(1,32,128,128)f32 #333=(1,32,128,128)f32
nn.LeakyReLU             encode.relu              1 1 333 334 negative_slope=2.000000e-01 #333=(1,32,128,128)f32 #334=(1,32,128,128)f32
nn.ConvTranspose2d       encode.cnn3              1 1 334 335 bias=True dilation=(1,1) groups=1 in_channels=32 kernel_size=(4,4) out_channels=8 output_padding=(0,0) padding=(1,1) stride=(2,2) @bias=(8)f32 @weight=(32,8,4,4)f32 #334=(1,32,128,128)f32 #335=(1,8,256,256)f32
prim::Constant           pnnx_48                  0 1 816 value=0
prim::Constant           pnnx_49                  0 1 817 value=0
prim::Constant           pnnx_50                  0 1 818 value=2147483647
prim::Constant           pnnx_51                  0 1 819 value=1
prim::Constant           pnnx_53                  0 1 820 value=1
prim::Constant           pnnx_54                  0 1 821 value=0
prim::Constant           pnnx_55                  0 1 822 value=3
prim::Constant           pnnx_56                  0 1 823 value=1
prim::Constant           pnnx_58                  0 1 824 value=0
prim::Constant           pnnx_59                  0 1 825 value=0
prim::Constant           pnnx_60                  0 1 826 value=2147483647
prim::Constant           pnnx_61                  0 1 827 value=1
prim::Constant           pnnx_63                  0 1 828 value=1
prim::Constant           pnnx_64                  0 1 829 value=0
prim::Constant           pnnx_65                  0 1 830 value=3
prim::Constant           pnnx_66                  0 1 831 value=1
Tensor.slice             Tensor.slice_20          5 1 img1.1 824 825 826 827 69 $input=img1.1 $dim=824 $start=825 $end=826 $step=827 #img1.1=(1,3,256,256)f32 #69=(1,3,256,256)f32
Tensor.slice             Tensor.slice_21          5 1 69 828 829 830 831 73 $input=69 $dim=828 $start=829 $end=830 $step=831 #69=(1,3,256,256)f32 #73=(1,3,256,256)f32
Tensor.slice             Tensor.slice_18          5 1 img0.1 816 817 818 819 63 $input=img0.1 $dim=816 $start=817 $end=818 $step=819 #img0.1=(1,3,256,256)f32 #63=(1,3,256,256)f32
Tensor.slice             Tensor.slice_19          5 1 63 820 821 822 823 66 $input=63 $dim=820 $start=821 $end=822 $step=823 #63=(1,3,256,256)f32 #66=(1,3,256,256)f32
Tensor.to                Tensor.to_78             1 1 36 timestep0.1 copy=False dtype=torch.float $input=36 #36=(1,1,256,256)f32 #timestep0.1=(1,1,256,256)f32
prim::ListConstruct      pnnx_68                  5 1 66 73 323 335 timestep0.1 77 #66=(1,3,256,256)f32 #73=(1,3,256,256)f32 #323=(1,8,256,256)f32 #335=(1,8,256,256)f32 #timestep0.1=(1,1,256,256)f32
prim::Constant           pnnx_69                  0 1 832 value=1
prim::Constant           pnnx_71                  0 1 336 value=8
prim::Constant           pnnx_74                  0 1 339 value=1.250000e-01
prim::Constant           pnnx_75                  0 1 340 value=8.000000e+00
prim::Constant           pnnx_76                  0 1 341 value=0
prim::Constant           pnnx_77                  0 1 342 value=2147483647
prim::Constant           pnnx_78                  0 1 343 value=1
prim::Constant           pnnx_79                  0 1 344 value=4
prim::Constant           pnnx_80                  0 1 345 value=5
prim::Constant           pnnx_81                  0 1 833 value=1.250000e-01
prim::ListConstruct      pnnx_82                  2 1 339 833 349
torch.cat                torch.cat_80             2 1 77 832 input1.1 $tensors=77 $dim=832 #input1.1=(1,23,256,256)f32
F.upsample               F.upsample_1             2 1 input1.1 349 input5.1 align_corners=False mode=bilinear $input=input1.1 $scale_factor=349 #input1.1=(1,23,256,256)f32 #input5.1=(1,23,32,32)f32
nn.Conv2d                block0.conv0.0.0         1 1 input5.1 355 bias=True dilation=(1,1) groups=1 in_channels=23 kernel_size=(3,3) out_channels=96 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(96)f32 @weight=(96,23,3,3)f32 #input5.1=(1,23,32,32)f32 #355=(1,96,16,16)f32
nn.LeakyReLU             block0.conv0.0.1         1 1 355 356 negative_slope=2.000000e-01 #355=(1,96,16,16)f32 #356=(1,96,16,16)f32
nn.Conv2d                block0.conv0.1.0         1 1 356 359 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(3,3) out_channels=192 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(192)f32 @weight=(192,96,3,3)f32 #356=(1,96,16,16)f32 #359=(1,192,8,8)f32
nn.LeakyReLU             block0.conv0.1.1         1 1 359 360 negative_slope=2.000000e-01 #359=(1,192,8,8)f32 #360=(1,192,8,8)f32
prim::Constant           pnnx_84                  0 1 369 value=1
pnnx.Attribute           block0.convblock.0       0 1 beta.3 @data=(1,192,1,1)f32 #beta.3=(1,192,1,1)f32
nn.Conv2d                block0.convblock.0.conv  1 1 360 373 bias=True dilation=(1,1) groups=1 in_channels=192 kernel_size=(3,3) out_channels=192 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(192)f32 @weight=(192,192,3,3)f32 #360=(1,192,8,8)f32 #373=(1,192,8,8)f32
aten::mul                pnnx_85                  2 1 373 beta.3 374 #373=(1,192,8,8)f32 #beta.3=(1,192,1,1)f32 #374=(1,192,8,8)f32
aten::add                pnnx_86                  3 1 374 360 369 input.5 #374=(1,192,8,8)f32 #360=(1,192,8,8)f32 #input.5=(1,192,8,8)f32
nn.LeakyReLU             block0.convblock.0.relu  1 1 input.5 376 negative_slope=2.000000e-01 #input.5=(1,192,8,8)f32 #376=(1,192,8,8)f32
prim::Constant           pnnx_87                  0 1 377 value=1
pnnx.Attribute           block0.convblock.1       0 1 beta.5 @data=(1,192,1,1)f32 #beta.5=(1,192,1,1)f32
nn.Conv2d                block0.convblock.1.conv  1 1 376 381 bias=True dilation=(1,1) groups=1 in_channels=192 kernel_size=(3,3) out_channels=192 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(192)f32 @weight=(192,192,3,3)f32 #376=(1,192,8,8)f32 #381=(1,192,8,8)f32
aten::mul                pnnx_88                  2 1 381 beta.5 382 #381=(1,192,8,8)f32 #beta.5=(1,192,1,1)f32 #382=(1,192,8,8)f32
aten::add                pnnx_89                  3 1 382 376 377 input.7 #382=(1,192,8,8)f32 #376=(1,192,8,8)f32 #input.7=(1,192,8,8)f32
nn.LeakyReLU             block0.convblock.1.relu  1 1 input.7 384 negative_slope=2.000000e-01 #input.7=(1,192,8,8)f32 #384=(1,192,8,8)f32
prim::Constant           pnnx_90                  0 1 385 value=1
pnnx.Attribute           block0.convblock.2       0 1 beta.7 @data=(1,192,1,1)f32 #beta.7=(1,192,1,1)f32
nn.Conv2d                block0.convblock.2.conv  1 1 384 389 bias=True dilation=(1,1) groups=1 in_channels=192 kernel_size=(3,3) out_channels=192 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(192)f32 @weight=(192,192,3,3)f32 #384=(1,192,8,8)f32 #389=(1,192,8,8)f32
aten::mul                pnnx_91                  2 1 389 beta.7 390 #389=(1,192,8,8)f32 #beta.7=(1,192,1,1)f32 #390=(1,192,8,8)f32
aten::add                pnnx_92                  3 1 390 384 385 input.9 #390=(1,192,8,8)f32 #384=(1,192,8,8)f32 #input.9=(1,192,8,8)f32
nn.LeakyReLU             block0.convblock.2.relu  1 1 input.9 392 negative_slope=2.000000e-01 #input.9=(1,192,8,8)f32 #392=(1,192,8,8)f32
prim::Constant           pnnx_93                  0 1 393 value=1
pnnx.Attribute           block0.convblock.3       0 1 beta.9 @data=(1,192,1,1)f32 #beta.9=(1,192,1,1)f32
nn.Conv2d                block0.convblock.3.conv  1 1 392 397 bias=True dilation=(1,1) groups=1 in_channels=192 kernel_size=(3,3) out_channels=192 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(192)f32 @weight=(192,192,3,3)f32 #392=(1,192,8,8)f32 #397=(1,192,8,8)f32
aten::mul                pnnx_94                  2 1 397 beta.9 398 #397=(1,192,8,8)f32 #beta.9=(1,192,1,1)f32 #398=(1,192,8,8)f32
aten::add                pnnx_95                  3 1 398 392 393 input.11 #398=(1,192,8,8)f32 #392=(1,192,8,8)f32 #input.11=(1,192,8,8)f32
nn.LeakyReLU             block0.convblock.3.relu  1 1 input.11 400 negative_slope=2.000000e-01 #input.11=(1,192,8,8)f32 #400=(1,192,8,8)f32
prim::Constant           pnnx_96                  0 1 401 value=1
pnnx.Attribute           block0.convblock.4       0 1 beta.11 @data=(1,192,1,1)f32 #beta.11=(1,192,1,1)f32
nn.Conv2d                block0.convblock.4.conv  1 1 400 405 bias=True dilation=(1,1) groups=1 in_channels=192 kernel_size=(3,3) out_channels=192 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(192)f32 @weight=(192,192,3,3)f32 #400=(1,192,8,8)f32 #405=(1,192,8,8)f32
aten::mul                pnnx_97                  2 1 405 beta.11 406 #405=(1,192,8,8)f32 #beta.11=(1,192,1,1)f32 #406=(1,192,8,8)f32
aten::add                pnnx_98                  3 1 406 400 401 input.13 #406=(1,192,8,8)f32 #400=(1,192,8,8)f32 #input.13=(1,192,8,8)f32
nn.LeakyReLU             block0.convblock.4.relu  1 1 input.13 408 negative_slope=2.000000e-01 #input.13=(1,192,8,8)f32 #408=(1,192,8,8)f32
prim::Constant           pnnx_99                  0 1 409 value=1
pnnx.Attribute           block0.convblock.5       0 1 beta.13 @data=(1,192,1,1)f32 #beta.13=(1,192,1,1)f32
nn.Conv2d                block0.convblock.5.conv  1 1 408 413 bias=True dilation=(1,1) groups=1 in_channels=192 kernel_size=(3,3) out_channels=192 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(192)f32 @weight=(192,192,3,3)f32 #408=(1,192,8,8)f32 #413=(1,192,8,8)f32
aten::mul                pnnx_100                 2 1 413 beta.13 414 #413=(1,192,8,8)f32 #beta.13=(1,192,1,1)f32 #414=(1,192,8,8)f32
aten::add                pnnx_101                 3 1 414 408 409 input.15 #414=(1,192,8,8)f32 #408=(1,192,8,8)f32 #input.15=(1,192,8,8)f32
nn.LeakyReLU             block0.convblock.5.relu  1 1 input.15 416 negative_slope=2.000000e-01 #input.15=(1,192,8,8)f32 #416=(1,192,8,8)f32
prim::Constant           pnnx_102                 0 1 417 value=1
pnnx.Attribute           block0.convblock.6       0 1 beta.15 @data=(1,192,1,1)f32 #beta.15=(1,192,1,1)f32
nn.Conv2d                block0.convblock.6.conv  1 1 416 421 bias=True dilation=(1,1) groups=1 in_channels=192 kernel_size=(3,3) out_channels=192 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(192)f32 @weight=(192,192,3,3)f32 #416=(1,192,8,8)f32 #421=(1,192,8,8)f32
aten::mul                pnnx_103                 2 1 421 beta.15 422 #421=(1,192,8,8)f32 #beta.15=(1,192,1,1)f32 #422=(1,192,8,8)f32
aten::add                pnnx_104                 3 1 422 416 417 input.17 #422=(1,192,8,8)f32 #416=(1,192,8,8)f32 #input.17=(1,192,8,8)f32
nn.LeakyReLU             block0.convblock.6.relu  1 1 input.17 424 negative_slope=2.000000e-01 #input.17=(1,192,8,8)f32 #424=(1,192,8,8)f32
prim::Constant           pnnx_105                 0 1 425 value=1
pnnx.Attribute           block0.convblock.7       0 1 beta.17 @data=(1,192,1,1)f32 #beta.17=(1,192,1,1)f32
nn.Conv2d                block0.convblock.7.conv  1 1 424 429 bias=True dilation=(1,1) groups=1 in_channels=192 kernel_size=(3,3) out_channels=192 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(192)f32 @weight=(192,192,3,3)f32 #424=(1,192,8,8)f32 #429=(1,192,8,8)f32
aten::mul                pnnx_106                 2 1 429 beta.17 430 #429=(1,192,8,8)f32 #beta.17=(1,192,1,1)f32 #430=(1,192,8,8)f32
aten::add                pnnx_107                 3 1 430 424 425 input.19 #430=(1,192,8,8)f32 #424=(1,192,8,8)f32 #input.19=(1,192,8,8)f32
nn.LeakyReLU             block0.convblock.7.relu  1 1 input.19 432 negative_slope=2.000000e-01 #input.19=(1,192,8,8)f32 #432=(1,192,8,8)f32
nn.ConvTranspose2d       block0.lastconv.0        1 1 432 435 bias=True dilation=(1,1) groups=1 in_channels=192 kernel_size=(4,4) out_channels=24 output_padding=(0,0) padding=(1,1) stride=(2,2) @bias=(24)f32 @weight=(192,24,4,4)f32 #432=(1,192,8,8)f32 #435=(1,24,16,16)f32
nn.PixelShuffle          block0.lastconv.1        1 1 435 436 upscale_factor=2 #435=(1,24,16,16)f32 #436=(1,6,32,32)f32
prim::Constant           pnnx_108                 0 1 834 value=8.000000e+00
prim::ListConstruct      pnnx_109                 2 1 340 834 437
prim::Constant           pnnx_113                 0 1 837 value=0
F.upsample               F.upsample_2             2 1 436 437 tmp.2 align_corners=False mode=bilinear $input=436 $scale_factor=437 #436=(1,6,32,32)f32 #tmp.2=(1,6,256,256)f32
prim::Constant           pnnx_115                 0 1 838 value=1
prim::Constant           pnnx_116                 0 1 839 value=0
prim::Constant           pnnx_117                 0 1 840 value=1
Tensor.slice             Tensor.slice_22          5 1 tmp.2 341 837 342 343 439 $input=tmp.2 $dim=341 $start=837 $end=342 $step=343 #tmp.2=(1,6,256,256)f32 #439=(1,6,256,256)f32
Tensor.slice             Tensor.slice_23          5 1 439 838 839 344 840 440 $input=439 $dim=838 $start=839 $end=344 $step=840 #439=(1,6,256,256)f32 #440=(1,4,256,256)f32
aten::mul                pnnx_119                 2 1 440 336 flow.15 #440=(1,4,256,256)f32 #flow.15=(1,4,256,256)f32
prim::Constant           pnnx_120                 0 1 841 value=0
prim::Constant           pnnx_121                 0 1 842 value=0
prim::Constant           pnnx_122                 0 1 843 value=2147483647
prim::Constant           pnnx_123                 0 1 844 value=1
prim::Constant           pnnx_125                 0 1 845 value=1
prim::Constant           pnnx_126                 0 1 846 value=4
prim::Constant           pnnx_127                 0 1 847 value=1
Tensor.slice             Tensor.slice_24          5 1 tmp.2 841 842 843 844 442 $input=tmp.2 $dim=841 $start=842 $end=843 $step=844 #tmp.2=(1,6,256,256)f32 #442=(1,6,256,256)f32
Tensor.slice             Tensor.slice_25          5 1 442 845 846 345 847 mask.7 $input=442 $dim=845 $start=846 $end=345 $step=847 #442=(1,6,256,256)f32 #mask.7=(1,1,256,256)f32
prim::TupleConstruct     pnnx_129                 2 1 flow.15 mask.7 444 #flow.15=(1,4,256,256)f32 #mask.7=(1,1,256,256)f32
prim::TupleUnpack        pnnx_130                 1 2 444 83 84 #83=(1,4,256,256)f32 #84=(1,1,256,256)f32
prim::Constant           pnnx_131                 0 1 848 value=0
prim::Constant           pnnx_132                 0 1 849 value=0
prim::Constant           pnnx_133                 0 1 850 value=2147483647
prim::Constant           pnnx_134                 0 1 851 value=1
prim::Constant           pnnx_136                 0 1 852 value=1
prim::Constant           pnnx_137                 0 1 853 value=0
prim::Constant           pnnx_138                 0 1 854 value=3
prim::Constant           pnnx_139                 0 1 855 value=1
Tensor.slice             Tensor.slice_26          5 1 83 848 849 850 851 87 $input=83 $dim=848 $start=849 $end=850 $step=851 #83=(1,4,256,256)f32 #87=(1,4,256,256)f32
Tensor.slice             Tensor.slice_27          5 1 87 852 853 854 855 91 $input=87 $dim=852 $start=853 $end=854 $step=855 #87=(1,4,256,256)f32 #91=(1,3,256,256)f32
aten::pow                pnnx_141                 2 1 img0.1 91 warped_img0.1 #img0.1=(1,3,256,256)f32 #91=(1,3,256,256)f32 #warped_img0.1=(1,3,256,256)f32
prim::Constant           pnnx_142                 0 1 856 value=0
prim::Constant           pnnx_143                 0 1 857 value=0
prim::Constant           pnnx_144                 0 1 858 value=2147483647
prim::Constant           pnnx_145                 0 1 859 value=1
prim::Constant           pnnx_147                 0 1 860 value=1
prim::Constant           pnnx_148                 0 1 861 value=1
prim::Constant           pnnx_149                 0 1 862 value=1
Tensor.slice             Tensor.slice_28          5 1 83 856 857 858 859 95 $input=83 $dim=856 $start=857 $end=858 $step=859 #83=(1,4,256,256)f32 #95=(1,4,256,256)f32
Tensor.slice             Tensor.slice_29          5 1 95 860 861 98 862 100 $input=95 $dim=860 $start=861 $end=98 $step=862 #95=(1,4,256,256)f32 #100=(1,3,256,256)f32
aten::pow                pnnx_151                 2 1 img1.1 100 warped_img1.1 #img1.1=(1,3,256,256)f32 #100=(1,3,256,256)f32 #warped_img1.1=(1,3,256,256)f32
prim::Constant           pnnx_152                 0 1 863 value=0
prim::Constant           pnnx_153                 0 1 864 value=0
prim::Constant           pnnx_154                 0 1 865 value=2147483647
prim::Constant           pnnx_155                 0 1 866 value=1
prim::Constant           pnnx_157                 0 1 867 value=1
prim::Constant           pnnx_158                 0 1 868 value=1
prim::Constant           pnnx_159                 0 1 869 value=1
Tensor.slice             Tensor.slice_30          5 1 83 863 864 865 866 104 $input=83 $dim=863 $start=864 $end=865 $step=866 #83=(1,4,256,256)f32 #104=(1,4,256,256)f32
Tensor.slice             Tensor.slice_31          5 1 104 867 868 107 869 109 $input=104 $dim=867 $start=868 $end=107 $step=869 #104=(1,4,256,256)f32 #109=(1,1,256,256)f32
aten::pow                pnnx_161                 2 1 323 109 wf0.1 #323=(1,8,256,256)f32 #109=(1,1,256,256)f32 #wf0.1=(1,8,256,256)f32
prim::Constant           pnnx_162                 0 1 870 value=0
prim::Constant           pnnx_163                 0 1 871 value=0
prim::Constant           pnnx_164                 0 1 872 value=2147483647
prim::Constant           pnnx_165                 0 1 873 value=1
prim::Constant           pnnx_167                 0 1 874 value=1
prim::Constant           pnnx_168                 0 1 875 value=2
prim::Constant           pnnx_169                 0 1 876 value=3
prim::Constant           pnnx_170                 0 1 877 value=1
Tensor.slice             Tensor.slice_32          5 1 83 870 871 872 873 113 $input=83 $dim=870 $start=871 $end=872 $step=873 #83=(1,4,256,256)f32 #113=(1,4,256,256)f32
Tensor.slice             Tensor.slice_33          5 1 113 874 875 876 877 117 $input=113 $dim=874 $start=875 $end=876 $step=877 #113=(1,4,256,256)f32 #117=(1,1,256,256)f32
aten::pow                pnnx_172                 2 1 335 117 wf1.1 #335=(1,8,256,256)f32 #117=(1,1,256,256)f32 #wf1.1=(1,8,256,256)f32
prim::Constant           pnnx_173                 0 1 878 value=0
prim::Constant           pnnx_174                 0 1 879 value=0
prim::Constant           pnnx_175                 0 1 880 value=2147483647
prim::Constant           pnnx_176                 0 1 881 value=1
prim::Constant           pnnx_178                 0 1 882 value=1
prim::Constant           pnnx_179                 0 1 883 value=0
prim::Constant           pnnx_180                 0 1 884 value=3
prim::Constant           pnnx_181                 0 1 885 value=1
prim::Constant           pnnx_183                 0 1 886 value=0
prim::Constant           pnnx_184                 0 1 887 value=0
prim::Constant           pnnx_185                 0 1 888 value=2147483647
prim::Constant           pnnx_186                 0 1 889 value=1
prim::Constant           pnnx_188                 0 1 890 value=1
prim::Constant           pnnx_189                 0 1 891 value=0
prim::Constant           pnnx_190                 0 1 892 value=3
prim::Constant           pnnx_191                 0 1 893 value=1
Tensor.slice             Tensor.slice_36          5 1 warped_img1.1 886 887 888 889 127 $input=warped_img1.1 $dim=886 $start=887 $end=888 $step=889 #warped_img1.1=(1,3,256,256)f32 #127=(1,3,256,256)f32
Tensor.slice             Tensor.slice_37          5 1 127 890 891 892 893 131 $input=127 $dim=890 $start=891 $end=892 $step=893 #127=(1,3,256,256)f32 #131=(1,3,256,256)f32
Tensor.slice             Tensor.slice_34          5 1 warped_img0.1 878 879 880 881 121 $input=warped_img0.1 $dim=878 $start=879 $end=880 $step=881 #warped_img0.1=(1,3,256,256)f32 #121=(1,3,256,256)f32
Tensor.slice             Tensor.slice_35          5 1 121 882 883 884 885 124 $input=121 $dim=882 $start=883 $end=884 $step=885 #121=(1,3,256,256)f32 #124=(1,3,256,256)f32
prim::ListConstruct      pnnx_193                 6 1 124 131 wf0.1 wf1.1 timestep0.1 84 136 #124=(1,3,256,256)f32 #131=(1,3,256,256)f32 #wf0.1=(1,8,256,256)f32 #wf1.1=(1,8,256,256)f32 #timestep0.1=(1,1,256,256)f32 #84=(1,1,256,256)f32
prim::Constant           pnnx_194                 0 1 894 value=1
prim::Constant           pnnx_196                 0 1 445 value=4
prim::Constant           pnnx_197                 0 1 446 value=1.000000e+00
prim::Constant           pnnx_200                 0 1 449 value=2.500000e-01
prim::Constant           pnnx_201                 0 1 450 value=1
prim::Constant           pnnx_202                 0 1 451 value=4.000000e+00
prim::Constant           pnnx_203                 0 1 452 value=0
prim::Constant           pnnx_204                 0 1 453 value=2147483647
prim::Constant           pnnx_205                 0 1 454 value=4
prim::Constant           pnnx_206                 0 1 455 value=5
prim::Constant           pnnx_207                 0 1 895 value=2.500000e-01
prim::ListConstruct      pnnx_208                 2 1 449 895 459
prim::Constant           pnnx_210                 0 1 896 value=2.500000e-01
prim::Constant           pnnx_211                 0 1 897 value=2.500000e-01
prim::ListConstruct      pnnx_212                 2 1 896 897 461
F.upsample               F.upsample_4             2 1 83 461 462 align_corners=False mode=bilinear $input=83 $scale_factor=461 #83=(1,4,256,256)f32 #462=(1,4,64,64)f32
aten::mul                pnnx_216                 2 1 462 446 463 #462=(1,4,64,64)f32 #463=(1,4,64,64)f32
aten::div                pnnx_217                 2 1 463 445 flow.1 #463=(1,4,64,64)f32 #flow.1=(1,4,64,64)f32
torch.cat                torch.cat_81             2 1 136 894 input2.1 $tensors=136 $dim=894 #input2.1=(1,24,256,256)f32
F.upsample               F.upsample_3             2 1 input2.1 459 x.2 align_corners=False mode=bilinear $input=input2.1 $scale_factor=459 #input2.1=(1,24,256,256)f32 #x.2=(1,24,64,64)f32
prim::ListConstruct      pnnx_218                 2 1 x.2 flow.1 465 #x.2=(1,24,64,64)f32 #flow.1=(1,4,64,64)f32
torch.cat                torch.cat_82             2 1 465 450 input0.5 $tensors=465 $dim=450 #input0.5=(1,28,64,64)f32
nn.Conv2d                block1.conv0.0.0         1 1 input0.5 471 bias=True dilation=(1,1) groups=1 in_channels=28 kernel_size=(3,3) out_channels=64 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(64)f32 @weight=(64,28,3,3)f32 #input0.5=(1,28,64,64)f32 #471=(1,64,32,32)f32
nn.LeakyReLU             block1.conv0.0.1         1 1 471 472 negative_slope=2.000000e-01 #471=(1,64,32,32)f32 #472=(1,64,32,32)f32
nn.Conv2d                block1.conv0.1.0         1 1 472 475 bias=True dilation=(1,1) groups=1 in_channels=64 kernel_size=(3,3) out_channels=128 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(128)f32 @weight=(128,64,3,3)f32 #472=(1,64,32,32)f32 #475=(1,128,16,16)f32
nn.LeakyReLU             block1.conv0.1.1         1 1 475 476 negative_slope=2.000000e-01 #475=(1,128,16,16)f32 #476=(1,128,16,16)f32
prim::Constant           pnnx_220                 0 1 485 value=1
pnnx.Attribute           block1.convblock.0       0 1 beta.19 @data=(1,128,1,1)f32 #beta.19=(1,128,1,1)f32
nn.Conv2d                block1.convblock.0.conv  1 1 476 489 bias=True dilation=(1,1) groups=1 in_channels=128 kernel_size=(3,3) out_channels=128 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(128)f32 @weight=(128,128,3,3)f32 #476=(1,128,16,16)f32 #489=(1,128,16,16)f32
aten::mul                pnnx_221                 2 1 489 beta.19 490 #489=(1,128,16,16)f32 #beta.19=(1,128,1,1)f32 #490=(1,128,16,16)f32
aten::add                pnnx_222                 3 1 490 476 485 input.21 #490=(1,128,16,16)f32 #476=(1,128,16,16)f32 #input.21=(1,128,16,16)f32
nn.LeakyReLU             block1.convblock.0.relu  1 1 input.21 492 negative_slope=2.000000e-01 #input.21=(1,128,16,16)f32 #492=(1,128,16,16)f32
prim::Constant           pnnx_223                 0 1 493 value=1
pnnx.Attribute           block1.convblock.1       0 1 beta.21 @data=(1,128,1,1)f32 #beta.21=(1,128,1,1)f32
nn.Conv2d                block1.convblock.1.conv  1 1 492 497 bias=True dilation=(1,1) groups=1 in_channels=128 kernel_size=(3,3) out_channels=128 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(128)f32 @weight=(128,128,3,3)f32 #492=(1,128,16,16)f32 #497=(1,128,16,16)f32
aten::mul                pnnx_224                 2 1 497 beta.21 498 #497=(1,128,16,16)f32 #beta.21=(1,128,1,1)f32 #498=(1,128,16,16)f32
aten::add                pnnx_225                 3 1 498 492 493 input.23 #498=(1,128,16,16)f32 #492=(1,128,16,16)f32 #input.23=(1,128,16,16)f32
nn.LeakyReLU             block1.convblock.1.relu  1 1 input.23 500 negative_slope=2.000000e-01 #input.23=(1,128,16,16)f32 #500=(1,128,16,16)f32
prim::Constant           pnnx_226                 0 1 501 value=1
pnnx.Attribute           block1.convblock.2       0 1 beta.23 @data=(1,128,1,1)f32 #beta.23=(1,128,1,1)f32
nn.Conv2d                block1.convblock.2.conv  1 1 500 505 bias=True dilation=(1,1) groups=1 in_channels=128 kernel_size=(3,3) out_channels=128 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(128)f32 @weight=(128,128,3,3)f32 #500=(1,128,16,16)f32 #505=(1,128,16,16)f32
aten::mul                pnnx_227                 2 1 505 beta.23 506 #505=(1,128,16,16)f32 #beta.23=(1,128,1,1)f32 #506=(1,128,16,16)f32
aten::add                pnnx_228                 3 1 506 500 501 input.25 #506=(1,128,16,16)f32 #500=(1,128,16,16)f32 #input.25=(1,128,16,16)f32
nn.LeakyReLU             block1.convblock.2.relu  1 1 input.25 508 negative_slope=2.000000e-01 #input.25=(1,128,16,16)f32 #508=(1,128,16,16)f32
prim::Constant           pnnx_229                 0 1 509 value=1
pnnx.Attribute           block1.convblock.3       0 1 beta.25 @data=(1,128,1,1)f32 #beta.25=(1,128,1,1)f32
nn.Conv2d                block1.convblock.3.conv  1 1 508 513 bias=True dilation=(1,1) groups=1 in_channels=128 kernel_size=(3,3) out_channels=128 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(128)f32 @weight=(128,128,3,3)f32 #508=(1,128,16,16)f32 #513=(1,128,16,16)f32
aten::mul                pnnx_230                 2 1 513 beta.25 514 #513=(1,128,16,16)f32 #beta.25=(1,128,1,1)f32 #514=(1,128,16,16)f32
aten::add                pnnx_231                 3 1 514 508 509 input.27 #514=(1,128,16,16)f32 #508=(1,128,16,16)f32 #input.27=(1,128,16,16)f32
nn.LeakyReLU             block1.convblock.3.relu  1 1 input.27 516 negative_slope=2.000000e-01 #input.27=(1,128,16,16)f32 #516=(1,128,16,16)f32
prim::Constant           pnnx_232                 0 1 517 value=1
pnnx.Attribute           block1.convblock.4       0 1 beta.27 @data=(1,128,1,1)f32 #beta.27=(1,128,1,1)f32
nn.Conv2d                block1.convblock.4.conv  1 1 516 521 bias=True dilation=(1,1) groups=1 in_channels=128 kernel_size=(3,3) out_channels=128 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(128)f32 @weight=(128,128,3,3)f32 #516=(1,128,16,16)f32 #521=(1,128,16,16)f32
aten::mul                pnnx_233                 2 1 521 beta.27 522 #521=(1,128,16,16)f32 #beta.27=(1,128,1,1)f32 #522=(1,128,16,16)f32
aten::add                pnnx_234                 3 1 522 516 517 input.29 #522=(1,128,16,16)f32 #516=(1,128,16,16)f32 #input.29=(1,128,16,16)f32
nn.LeakyReLU             block1.convblock.4.relu  1 1 input.29 524 negative_slope=2.000000e-01 #input.29=(1,128,16,16)f32 #524=(1,128,16,16)f32
prim::Constant           pnnx_235                 0 1 525 value=1
pnnx.Attribute           block1.convblock.5       0 1 beta.29 @data=(1,128,1,1)f32 #beta.29=(1,128,1,1)f32
nn.Conv2d                block1.convblock.5.conv  1 1 524 529 bias=True dilation=(1,1) groups=1 in_channels=128 kernel_size=(3,3) out_channels=128 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(128)f32 @weight=(128,128,3,3)f32 #524=(1,128,16,16)f32 #529=(1,128,16,16)f32
aten::mul                pnnx_236                 2 1 529 beta.29 530 #529=(1,128,16,16)f32 #beta.29=(1,128,1,1)f32 #530=(1,128,16,16)f32
aten::add                pnnx_237                 3 1 530 524 525 input.31 #530=(1,128,16,16)f32 #524=(1,128,16,16)f32 #input.31=(1,128,16,16)f32
nn.LeakyReLU             block1.convblock.5.relu  1 1 input.31 532 negative_slope=2.000000e-01 #input.31=(1,128,16,16)f32 #532=(1,128,16,16)f32
prim::Constant           pnnx_238                 0 1 533 value=1
pnnx.Attribute           block1.convblock.6       0 1 beta.31 @data=(1,128,1,1)f32 #beta.31=(1,128,1,1)f32
nn.Conv2d                block1.convblock.6.conv  1 1 532 537 bias=True dilation=(1,1) groups=1 in_channels=128 kernel_size=(3,3) out_channels=128 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(128)f32 @weight=(128,128,3,3)f32 #532=(1,128,16,16)f32 #537=(1,128,16,16)f32
aten::mul                pnnx_239                 2 1 537 beta.31 538 #537=(1,128,16,16)f32 #beta.31=(1,128,1,1)f32 #538=(1,128,16,16)f32
aten::add                pnnx_240                 3 1 538 532 533 input.33 #538=(1,128,16,16)f32 #532=(1,128,16,16)f32 #input.33=(1,128,16,16)f32
nn.LeakyReLU             block1.convblock.6.relu  1 1 input.33 540 negative_slope=2.000000e-01 #input.33=(1,128,16,16)f32 #540=(1,128,16,16)f32
prim::Constant           pnnx_241                 0 1 541 value=1
pnnx.Attribute           block1.convblock.7       0 1 beta.33 @data=(1,128,1,1)f32 #beta.33=(1,128,1,1)f32
nn.Conv2d                block1.convblock.7.conv  1 1 540 545 bias=True dilation=(1,1) groups=1 in_channels=128 kernel_size=(3,3) out_channels=128 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(128)f32 @weight=(128,128,3,3)f32 #540=(1,128,16,16)f32 #545=(1,128,16,16)f32
aten::mul                pnnx_242                 2 1 545 beta.33 546 #545=(1,128,16,16)f32 #beta.33=(1,128,1,1)f32 #546=(1,128,16,16)f32
aten::add                pnnx_243                 3 1 546 540 541 input.35 #546=(1,128,16,16)f32 #540=(1,128,16,16)f32 #input.35=(1,128,16,16)f32
nn.LeakyReLU             block1.convblock.7.relu  1 1 input.35 548 negative_slope=2.000000e-01 #input.35=(1,128,16,16)f32 #548=(1,128,16,16)f32
nn.ConvTranspose2d       block1.lastconv.0        1 1 548 551 bias=True dilation=(1,1) groups=1 in_channels=128 kernel_size=(4,4) out_channels=24 output_padding=(0,0) padding=(1,1) stride=(2,2) @bias=(24)f32 @weight=(128,24,4,4)f32 #548=(1,128,16,16)f32 #551=(1,24,32,32)f32
nn.PixelShuffle          block1.lastconv.1        1 1 551 552 upscale_factor=2 #551=(1,24,32,32)f32 #552=(1,6,64,64)f32
prim::Constant           pnnx_244                 0 1 900 value=4.000000e+00
prim::ListConstruct      pnnx_245                 2 1 451 900 553
prim::Constant           pnnx_249                 0 1 903 value=0
prim::Constant           pnnx_250                 0 1 904 value=1
F.upsample               F.upsample_5             2 1 552 553 tmp.4 align_corners=False mode=bilinear $input=552 $scale_factor=553 #552=(1,6,64,64)f32 #tmp.4=(1,6,256,256)f32
prim::Constant           pnnx_252                 0 1 905 value=1
prim::Constant           pnnx_253                 0 1 906 value=0
prim::Constant           pnnx_254                 0 1 907 value=1
prim::Constant           pnnx_256                 0 1 908 value=4
Tensor.slice             Tensor.slice_38          5 1 tmp.4 452 903 453 904 555 $input=tmp.4 $dim=452 $start=903 $end=453 $step=904 #tmp.4=(1,6,256,256)f32 #555=(1,6,256,256)f32
Tensor.slice             Tensor.slice_39          5 1 555 905 906 454 907 556 $input=555 $dim=905 $start=906 $end=454 $step=907 #555=(1,6,256,256)f32 #556=(1,4,256,256)f32
aten::mul                pnnx_257                 2 1 556 908 fd.2 #556=(1,4,256,256)f32 #fd.2=(1,4,256,256)f32
prim::Constant           pnnx_258                 0 1 909 value=0
prim::Constant           pnnx_259                 0 1 910 value=0
prim::Constant           pnnx_260                 0 1 911 value=2147483647
prim::Constant           pnnx_261                 0 1 912 value=1
prim::Constant           pnnx_263                 0 1 913 value=1
prim::Constant           pnnx_264                 0 1 914 value=4
prim::Constant           pnnx_265                 0 1 915 value=1
Tensor.slice             Tensor.slice_40          5 1 tmp.4 909 910 911 912 558 $input=tmp.4 $dim=909 $start=910 $end=911 $step=912 #tmp.4=(1,6,256,256)f32 #558=(1,6,256,256)f32
Tensor.slice             Tensor.slice_41          5 1 558 913 914 455 915 mask.9 $input=558 $dim=913 $start=914 $end=455 $step=915 #558=(1,6,256,256)f32 #mask.9=(1,1,256,256)f32
prim::TupleConstruct     pnnx_267                 2 1 fd.2 mask.9 560 #fd.2=(1,4,256,256)f32 #mask.9=(1,1,256,256)f32
prim::TupleUnpack        pnnx_268                 1 2 560 143 144 #143=(1,4,256,256)f32 #144=(1,1,256,256)f32
prim::Constant           pnnx_269                 0 1 916 value=1
aten::add                pnnx_270                 3 1 83 143 916 flow.13 #83=(1,4,256,256)f32 #143=(1,4,256,256)f32 #flow.13=(1,4,256,256)f32
prim::Constant           pnnx_271                 0 1 917 value=0
prim::Constant           pnnx_272                 0 1 918 value=0
prim::Constant           pnnx_273                 0 1 919 value=2147483647
prim::Constant           pnnx_274                 0 1 920 value=1
prim::Constant           pnnx_276                 0 1 921 value=1
prim::Constant           pnnx_277                 0 1 922 value=0
prim::Constant           pnnx_278                 0 1 923 value=3
prim::Constant           pnnx_279                 0 1 924 value=1
Tensor.slice             Tensor.slice_42          5 1 flow.13 917 918 919 920 151 $input=flow.13 $dim=917 $start=918 $end=919 $step=920 #flow.13=(1,4,256,256)f32 #151=(1,4,256,256)f32
Tensor.slice             Tensor.slice_43          5 1 151 921 922 923 924 155 $input=151 $dim=921 $start=922 $end=923 $step=924 #151=(1,4,256,256)f32 #155=(1,3,256,256)f32
aten::pow                pnnx_281                 2 1 img0.1 155 warped_img00.1 #img0.1=(1,3,256,256)f32 #155=(1,3,256,256)f32 #warped_img00.1=(1,3,256,256)f32
prim::Constant           pnnx_282                 0 1 925 value=0
prim::Constant           pnnx_283                 0 1 926 value=0
prim::Constant           pnnx_284                 0 1 927 value=2147483647
prim::Constant           pnnx_285                 0 1 928 value=1
prim::Constant           pnnx_287                 0 1 929 value=1
prim::Constant           pnnx_288                 0 1 930 value=1
prim::Constant           pnnx_289                 0 1 931 value=4
prim::Constant           pnnx_290                 0 1 932 value=1
Tensor.slice             Tensor.slice_44          5 1 flow.13 925 926 927 928 159 $input=flow.13 $dim=925 $start=926 $end=927 $step=928 #flow.13=(1,4,256,256)f32 #159=(1,4,256,256)f32
Tensor.slice             Tensor.slice_45          5 1 159 929 930 931 932 163 $input=159 $dim=929 $start=930 $end=931 $step=932 #159=(1,4,256,256)f32 #163=(1,3,256,256)f32
aten::pow                pnnx_292                 2 1 img1.1 163 warped_img10.1 #img1.1=(1,3,256,256)f32 #163=(1,3,256,256)f32 #warped_img10.1=(1,3,256,256)f32
prim::Constant           pnnx_293                 0 1 933 value=0
prim::Constant           pnnx_294                 0 1 934 value=0
prim::Constant           pnnx_295                 0 1 935 value=2147483647
prim::Constant           pnnx_296                 0 1 936 value=1
prim::Constant           pnnx_298                 0 1 937 value=1
prim::Constant           pnnx_299                 0 1 938 value=1
prim::Constant           pnnx_300                 0 1 939 value=2
prim::Constant           pnnx_301                 0 1 940 value=1
Tensor.slice             Tensor.slice_46          5 1 flow.13 933 934 935 936 167 $input=flow.13 $dim=933 $start=934 $end=935 $step=936 #flow.13=(1,4,256,256)f32 #167=(1,4,256,256)f32
Tensor.slice             Tensor.slice_47          5 1 167 937 938 939 940 171 $input=167 $dim=937 $start=938 $end=939 $step=940 #167=(1,4,256,256)f32 #171=(1,1,256,256)f32
aten::pow                pnnx_303                 2 1 323 171 wf00.1 #323=(1,8,256,256)f32 #171=(1,1,256,256)f32 #wf00.1=(1,8,256,256)f32
prim::Constant           pnnx_304                 0 1 941 value=0
prim::Constant           pnnx_305                 0 1 942 value=0
prim::Constant           pnnx_306                 0 1 943 value=2147483647
prim::Constant           pnnx_307                 0 1 944 value=1
prim::Constant           pnnx_309                 0 1 945 value=1
prim::Constant           pnnx_310                 0 1 946 value=2
prim::Constant           pnnx_311                 0 1 947 value=3
prim::Constant           pnnx_312                 0 1 948 value=1
Tensor.slice             Tensor.slice_48          5 1 flow.13 941 942 943 944 175 $input=flow.13 $dim=941 $start=942 $end=943 $step=944 #flow.13=(1,4,256,256)f32 #175=(1,4,256,256)f32
Tensor.slice             Tensor.slice_49          5 1 175 945 946 947 948 179 $input=175 $dim=945 $start=946 $end=947 $step=948 #175=(1,4,256,256)f32 #179=(1,1,256,256)f32
aten::pow                pnnx_314                 2 1 335 179 wf10.1 #335=(1,8,256,256)f32 #179=(1,1,256,256)f32 #wf10.1=(1,8,256,256)f32
prim::Constant           pnnx_315                 0 1 949 value=0
prim::Constant           pnnx_316                 0 1 950 value=0
prim::Constant           pnnx_317                 0 1 951 value=2147483647
prim::Constant           pnnx_318                 0 1 952 value=1
prim::Constant           pnnx_320                 0 1 953 value=1
prim::Constant           pnnx_321                 0 1 954 value=0
prim::Constant           pnnx_322                 0 1 955 value=3
prim::Constant           pnnx_323                 0 1 956 value=1
prim::Constant           pnnx_325                 0 1 957 value=0
prim::Constant           pnnx_326                 0 1 958 value=0
prim::Constant           pnnx_327                 0 1 959 value=2147483647
prim::Constant           pnnx_328                 0 1 960 value=1
prim::Constant           pnnx_330                 0 1 961 value=1
prim::Constant           pnnx_331                 0 1 962 value=0
prim::Constant           pnnx_332                 0 1 963 value=3
prim::Constant           pnnx_333                 0 1 964 value=1
Tensor.slice             Tensor.slice_52          5 1 warped_img10.1 957 958 959 960 189 $input=warped_img10.1 $dim=957 $start=958 $end=959 $step=960 #warped_img10.1=(1,3,256,256)f32 #189=(1,3,256,256)f32
Tensor.slice             Tensor.slice_53          5 1 189 961 962 963 964 193 $input=189 $dim=961 $start=962 $end=963 $step=964 #189=(1,3,256,256)f32 #193=(1,3,256,256)f32
Tensor.slice             Tensor.slice_50          5 1 warped_img00.1 949 950 951 952 183 $input=warped_img00.1 $dim=949 $start=950 $end=951 $step=952 #warped_img00.1=(1,3,256,256)f32 #183=(1,3,256,256)f32
Tensor.slice             Tensor.slice_51          5 1 183 953 954 955 956 186 $input=183 $dim=953 $start=954 $end=955 $step=956 #183=(1,3,256,256)f32 #186=(1,3,256,256)f32
prim::ListConstruct      pnnx_335                 6 1 186 193 wf00.1 wf10.1 timestep0.1 144 198 #186=(1,3,256,256)f32 #193=(1,3,256,256)f32 #wf00.1=(1,8,256,256)f32 #wf10.1=(1,8,256,256)f32 #timestep0.1=(1,1,256,256)f32 #144=(1,1,256,256)f32
prim::Constant           pnnx_336                 0 1 965 value=1
prim::Constant           pnnx_338                 0 1 561 value=2
prim::Constant           pnnx_339                 0 1 562 value=1.000000e+00
prim::Constant           pnnx_342                 0 1 565 value=5.000000e-01
prim::Constant           pnnx_343                 0 1 566 value=1
prim::Constant           pnnx_344                 0 1 567 value=2.000000e+00
prim::Constant           pnnx_345                 0 1 568 value=0
prim::Constant           pnnx_346                 0 1 569 value=2147483647
prim::Constant           pnnx_347                 0 1 570 value=4
prim::Constant           pnnx_348                 0 1 571 value=5
prim::Constant           pnnx_349                 0 1 966 value=5.000000e-01
prim::ListConstruct      pnnx_350                 2 1 565 966 575
prim::Constant           pnnx_352                 0 1 967 value=5.000000e-01
prim::Constant           pnnx_353                 0 1 968 value=5.000000e-01
prim::ListConstruct      pnnx_354                 2 1 967 968 577
F.upsample               F.upsample_7             2 1 flow.13 577 578 align_corners=False mode=bilinear $input=flow.13 $scale_factor=577 #flow.13=(1,4,256,256)f32 #578=(1,4,128,128)f32
aten::mul                pnnx_358                 2 1 578 562 579 #578=(1,4,128,128)f32 #579=(1,4,128,128)f32
aten::div                pnnx_359                 2 1 579 561 flow0.15 #579=(1,4,128,128)f32 #flow0.15=(1,4,128,128)f32
torch.cat                torch.cat_83             2 1 198 965 input3.1 $tensors=198 $dim=965 #input3.1=(1,24,256,256)f32
F.upsample               F.upsample_6             2 1 input3.1 575 x.4 align_corners=False mode=bilinear $input=input3.1 $scale_factor=575 #input3.1=(1,24,256,256)f32 #x.4=(1,24,128,128)f32
prim::ListConstruct      pnnx_360                 2 1 x.4 flow0.15 581 #x.4=(1,24,128,128)f32 #flow0.15=(1,4,128,128)f32
torch.cat                torch.cat_84             2 1 581 566 input0.7 $tensors=581 $dim=566 #input0.7=(1,28,128,128)f32
nn.Conv2d                block2.conv0.0.0         1 1 input0.7 587 bias=True dilation=(1,1) groups=1 in_channels=28 kernel_size=(3,3) out_channels=48 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(48)f32 @weight=(48,28,3,3)f32 #input0.7=(1,28,128,128)f32 #587=(1,48,64,64)f32
nn.LeakyReLU             block2.conv0.0.1         1 1 587 588 negative_slope=2.000000e-01 #587=(1,48,64,64)f32 #588=(1,48,64,64)f32
nn.Conv2d                block2.conv0.1.0         1 1 588 591 bias=True dilation=(1,1) groups=1 in_channels=48 kernel_size=(3,3) out_channels=96 padding=(1,1) padding_mode=zeros stride=(2,2) @bias=(96)f32 @weight=(96,48,3,3)f32 #588=(1,48,64,64)f32 #591=(1,96,32,32)f32
nn.LeakyReLU             block2.conv0.1.1         1 1 591 592 negative_slope=2.000000e-01 #591=(1,96,32,32)f32 #592=(1,96,32,32)f32
prim::Constant           pnnx_362                 0 1 601 value=1
pnnx.Attribute           block2.convblock.0       0 1 beta.35 @data=(1,96,1,1)f32 #beta.35=(1,96,1,1)f32
nn.Conv2d                block2.convblock.0.conv  1 1 592 605 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(3,3) out_channels=96 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(96)f32 @weight=(96,96,3,3)f32 #592=(1,96,32,32)f32 #605=(1,96,32,32)f32
aten::mul                pnnx_363                 2 1 605 beta.35 606 #605=(1,96,32,32)f32 #beta.35=(1,96,1,1)f32 #606=(1,96,32,32)f32
aten::add                pnnx_364                 3 1 606 592 601 input.37 #606=(1,96,32,32)f32 #592=(1,96,32,32)f32 #input.37=(1,96,32,32)f32
nn.LeakyReLU             block2.convblock.0.relu  1 1 input.37 608 negative_slope=2.000000e-01 #input.37=(1,96,32,32)f32 #608=(1,96,32,32)f32
prim::Constant           pnnx_365                 0 1 609 value=1
pnnx.Attribute           block2.convblock.1       0 1 beta.37 @data=(1,96,1,1)f32 #beta.37=(1,96,1,1)f32
nn.Conv2d                block2.convblock.1.conv  1 1 608 613 bias=True dilation=(1,1) groups=1 in_channels=96 kernel_size=(3,3) out_channels=96 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(96)f32 @weight=(96,96,3,3)f32 #608=(1,96,32,32)f32 #613=(1,96,32,32)f32
aten::mul                pnnx_366                 2 1 613 beta.37 614 #613=(1,96,32,32)f32 #beta.37=(1,96,1,1)f32 #614=(1,96,32,32)f32
aten::add                pnnx_367                 3 1 614 608 609 input.39 #614=(1,96,32,32)f32 #608=(1,96,32,32)f32 #input.39=(1,96,32,32)f32
nn.LeakyReLU             block2.convblock.1.relu  1 1 input.39 616 negative_slope=2.000000e-01 #input.39=(1,96,32,32)f32 #616=(1,96,32,32)f32
prim::Constant           pnnx_368                 0 1 617 value=1
